print('Лабораторна робота №1; Варіант №7.Завдання №3:\
 \nОбчислення конкретної функції, в залежності від введеного значення х')
print('Доротюк Т.В. КМ-91')
while True:
    print('Ця програма здатна розрахувати значення функції в залежності від змінної х \
    \nЯкщо ви бажаєте продовжити роботу з програмою, натисніть "Y", а якщо ні - "N"')
    dec_1 = input( )
    while dec_1 !="N" and dec_1 !="Y":
        print('Використовуйте для відповіді лише "Y" і "N"')
        del dec_1
        dec_1 = input()
    if dec_1 == "Y":
        try:
            x = float(input('x= '))
        except (ValueError, NameError):
            print('Ви ввели невірний тип даних. Програма працює тільки з числами')

        if x >= 0 and x <= 3:
            res_1 = pow(x, 2)
        elif x > 3:
            res_1 = 4
        else:
            res_1 = 4
        print('При введеному Вами х функція набуває такого значення: ' + str(res_1))
    elif dec_1 == "N":
        print('Роботу з програмою буде завершено. Ви зможете скористуватися нею пізніше')

    to_exit = input("Щоб продовжити розрахунки, просто натисніть A, або будь-який інший символ для завершення роботи")
    if to_exit == "A":
        continue
    else:
        break
print('Роботу з програмою завершено!')