print('Лабораторна робота №1; Варіант №7.Завдання №2:\
 \nПідрахувати кількість негативних серед чисел а, b, с (ввести з клавіатури).')
print('Доротюк Т.В. КМ-91')

while True:
    print('Ця програма здатна вказати кількість негативних чисел з-поміж введених користувачом\
    \nЯкщо ви бажаєте продовжити роботу з програмою, натисніть "Y", а якщо ні - "N"')
    dec_1 = input( )
    while dec_1 !="N" and dec_1 !="Y":
        print('Використовуйте для відповіді лише "Y" і "N"')
        del dec_1
        dec_1 = input()
    if dec_1 == "Y":
        try:
            a = float(input('Введіть перше число: '))
            b = float(input('Введіть друге число: '))
            c = float(input('Введіть третє число: '))
        except (ValueError, NameError):
            print('Ви ввели невірний тип даних. Програма працює тільки з числами')
            continue
        lol = [a, b, c]
        negatives = 0
        for a in lol:
            negatives += ( a  < 0 )
        print('Кількість негативних чисел серед введених Вами: '+ str(negatives))
    elif dec_1 == "N":
        print('Роботу з програмою буде завершено. Ви зможете скористуватися нею пізніше')

    to_exit = input("Щоб продовжити розрахунки, просто натисніть A, або будь-який інший символ для завершення роботи")
    if to_exit == "A":
        continue
    else:
        break
print('Роботу з програмою завершено')